In [1]:
import pandas as pd
from sqlalchemy import create_engine

username = "root"
password = "root"
server = "127.0.0.1"
db_name = "TESTDB"

conn = create_engine(
    f"mysql+pymysql://{username}:{password}@{server}/{db_name}",
).connect()

In [2]:
df = pd.read_sql(
    "select * from staff",
    conn,
)

In [3]:
df

    ID   Name DeptId  Age Gender  Salary            recordDt
0  001   Mike    002   45      M   60000 2023-10-22 15:10:00
1  002   Judy    002   30      F   48000 2023-10-22 15:10:00
2  003  Allen    001   22      M   50000 2023-10-22 15:10:00
3  004    Tom    002   47      M   47000 2023-10-22 15:10:00
4  005   Jack    003   36      M   52000 2023-10-22 15:10:00
5  006   Abby    002   24      F   45000 2023-10-22 15:10:00
6  007  Trump    001   80      M   80000 2023-10-22 15:10:00
7  008  Marry    003   29      F   87000 2023-10-22 15:10:00

In [4]:
df.dtypes

ID                  object
Name                object
DeptId              object
Age                  int64
Gender              object
Salary               int64
recordDt    datetime64[ns]
dtype: object

In [5]:
df["ID"] = df["ID"].apply(lambda x: x + "000")

In [6]:
df

       ID   Name DeptId  Age Gender  Salary            recordDt
0  001000   Mike    002   45      M   60000 2023-10-22 15:10:00
1  002000   Judy    002   30      F   48000 2023-10-22 15:10:00
2  003000  Allen    001   22      M   50000 2023-10-22 15:10:00
3  004000    Tom    002   47      M   47000 2023-10-22 15:10:00
4  005000   Jack    003   36      M   52000 2023-10-22 15:10:00
5  006000   Abby    002   24      F   45000 2023-10-22 15:10:00
6  007000  Trump    001   80      M   80000 2023-10-22 15:10:00
7  008000  Marry    003   29      F   87000 2023-10-22 15:10:00

In [7]:
df.to_sql("staff", conn, if_exists="append", index=0)

8

In [8]:
conn.commit()